
# bot
admin_chat_id = 330926012

# start

start_info = """, вітаємо Вас у чат-боті Національного університету "Полтавська політехніка імені Юрія Кондратюка" (НУПП) для вступників 👨‍🎓

ℹ️ Яка інформація Вас цікавить?
"""

# lessons

lessons_info = """
Який освітній рівень Вас цікавить?
"""

# university

university_info = """
😍 <b>Наші переваги</b>:

1. Міжнародні програми
2. Підготовчі курси
3. Держзамовлення
4. Вступ на основі повної загальної середньої освіти
5. Вступ на основі ступеня молодшого спеціаліста
6. Вступ на основі ступеня бакалавра, магістра
7. Вступ та навчання на кафедру військової підготовки
8. Післядипломна освіта
9. Аспірантура та Докторантура 
"""

university_how_find_us = """
<b>Як нас знайти?</b>

36011, м. Полтава, Першотравневий проспект, 24.
Номер кімнати: 123 (1 поверх, ліворуч від центрального входу)
"""

# zno

zno_info = """
<b>ЗНО (НМТ) 2022</b>

Зовнішнє незалежне оцінювання цього року відбудеться у спрощеному форматі. Відповідні зміни вже затвердила Верховна Рада України.

Для вступників розроблять <b>національний мультипредметний тест з трьох предметів</b>:
• української мови, 
• математики,
• історії України.

Завдань з української літератури не буде.

Загалом учасники ЗНО повинні виконати <b>60 завдань за 80 хвилин</b>.

Зовнішнє незалежне оцінювання проводитиметься онлайн в тимчасових екзаменаційних центрах (у цьому розумінні вони онлайн), але не буде можливості їх складання з власних смартфонів у будь-якому місці.
Випускники повинні будуть прийти до визначеного в районі місця проживання (або тимчасового перебування) центру тестування і скласти іспит. Враховуючи воєнний стан в країні і високу ймовірність повітряних тривог у різних регіонах, <b>тестування не буде проводитися в один день і в один час</b>.

Майбутні вступники матимуть на проходження тесту <b>мінімум 10 днів</b>. 

Щоразу варіанти завдань будуть різними, аби забезпечити прозорість результатів.

<b>Як буде оцінюватися мультипредметний тест:</b> 
Оцінка буде відповідати чинним програмам ЗНО і результат кожного зі складників тесту буде подаватися у тестових балах, а також за шкалою 100 – 200.
"""

zno_language_info = """
<b>Яким буде зміст завдань блоку НМТ з української мови?</b>

Зміст завдань блоку НМТ з української мови буде відповідати чинній програмі ЗНО з української мови. Зверніть увагу, що у відповідній програмі вас має цікавити лише та частина, що стосується української мови. Ця частина охоплює всі мовні теми, вивчення яких передбачено в шкільному курсі української мови, а саме теми: 
•	«Фонетика. Графіка. Орфоепія. Орфографія»;
•	«Лексикологія. Фразеологія»;
•	«Будова слова. Словотвір»;
•	«Морфологія»;
•	«Синтаксис»;
•	«Стилістика»;
•	«Розвиток мовлення».

Питома вага до того чи того розділу мовознавства в змісті блоку НМТ з української мови загалом відповідає тому, що характеризує зміст тестів ЗНО з української мови. Щоправда, розділам «Стилістика» та «Розвиток мовлення» приділено дещо менше уваги з огляду на комп’ютерний формат тестування, який, зокрема, унеможливлює використання завдань на надання письмової розгорнутої чи короткої відповідей.
"""

zno_math_info = """ 
<b>Яким буде зміст завдань блоку НМТ з математики?</b>

Зміст завдань блоку НМТ з математики буде відповідати чинній програмі ЗНО з математики. Ця програма охоплює всі теми з алгебри й геометрії, які вивчалися у шкільному курсі, а саме: 
•	«Числа і вирази»;
•	«Рівняння, нерівності і їх системи»;
•	«Функції»;
•	«Ймовірність випадкової події, вибіркові характеристики (середнє значення), аналіз діаграм та графіків»;
•	«Планіметрія»;
•	«Стереометрія».
"""

zno_history_info = """
<b>Яким буде зміст завдань блоку НМТ з історії України?</b>

Зміст завдань блоку НМТ з історії України буде відповідати чинній програмі ЗНО з історії України. Ця частина охоплює певні теми, вивчення яких передбачено в шкільному курсі історії України, а саме теми: 
•	Україна в роки Першої світової війни;
•	Початок Української революції;
•	Розгортання Української революції. Боротьба за відновлення державності; 
•	Встановлення комуністичного тоталітарного режиму в Україні;
•	Утвердження більшовицького тоталітарного режиму в Україні;
•	Західноукраїнські землі в міжвоєнний період;
•	Україна в роки Другої світової війни;
•	Україна в перші повоєнні роки;
•	Україна в умовах десталінізації;
•	Україна в період загострення кризи радянської системи;
•	Відновлення незалежності України;
•	Становлення України як незалежної держави;
•	Творення нової України.

Зверніть увагу, що в блоці НМТ з історії України будуть завдання, що стосуються історичного періоду: «Історія України 1914 р.– початку ХХІ ст.», тобто лише теми, які раніше були складниками ДПА у формі ЗНО з історії України.
"""

# vstup

vstup_info = """
Механізм вступу до закладів вищої освіти такий самий, як і в минулих роках. Єдина відмінність – <b>тепер сертифікатів про проходження ЗНО буде не чотири, а один</b>.

Будуть такі ж електронні заяви й така ж електронна база. Просто замість чотирьох сертифікатів ЗНО буде підвантажуватися один – про проходження <b>мультипредметного тесту</b>.

Також абітурієнти для вступу мають подавати <b>мотиваційний лист –</b> документ, у якому пояснюють причини, з яких вважають себе найкращими кандидатами для вступу на відповідну навчальну програму конкретного університету.

<b>Подання документів, співбесіди, творчі конкурси, фахові іспити і підтвердження місця навчання зможуть відбуватися з будь-якої точки світу</b>.

Атестат, медаль, призові місця в олімпіаді не будуть впливати при вступі.
"""

vstup_sertificat = """
<b>Чи можна використати сертифікат ЗНО минулих років?</b>

Якщо абітурієнт з тих чи інших причин має сертифікат ЗНО за 2019, 2020 або 2021 роки – ним можна скористатися цього року. Якщо абітурієнт має кілька сертифікатів ЗНО за різні роки, то він має право використати під час подачі документів сертифікати, які мають вищі бали з того чи іншого предмета.
"""

vstup_child = """
<b>Чи будуть складати ЗНО діти з окупованих територій?</b>

Наразі на тимчасово окупованих територіях України неможливо складати іспит без критичного ризику для життя і здоров’я випускників. Для того, щоб скласти ЗНО цього року, необхідно переїхати на підконтрольну територію. Ми будемо намагатися зробити основну, додаткову та спеціальну сесію. Тобто, буде мінімум три сесії, коли кожен, хто захоче складати мультипредметний тест в Україні, зможе це зробити.
"""

vstup_balls = """
<b>Порогові бали</b>

Для вступу на основі загальної середньої освіти (державне замовлення) – не менше за <b>125</b>;

Для медичних спеціальностей, зокрема стоматологія (222, 228), педіатрія – <b>150</b> (за винятком вступників за конкурсним балом більше <b>175</b> балів);

Для здобуття освітнього рівня магістра за спеціальністю фармація, промислова фармація (226) – <b>130</b> балів;

Для спеціальностей галузей право (08), публічне управління, адміністрування (28), міжнародні відносини (29) – <b>140</b> балів.
"""

vstup_atestat = """
<b>Хто може видавати атестат?</b>

Свідоцтво про повну загальну середню освіту може видавати як школа, що знаходиться у місті постійного проживання дитини, так і заклад освіти, куди її зараховано тимчасово.
Для того, щоб отримати документ, необхідно зв’язатися з керівниками шкіл. Одна з них має зробити замовлення на свідоцтво. Потрібно зареєструватися у школі, де тимчасово проживаєте. Можете обрати будь-який заклад освіти, можна доєднатися до будь-якої онлайн-школи, що є на сайті МОН, особливо якщо ви за кордоном
"""

vstup_addiction_information = """
<b>Додаткова інформація</b>

<i>Вступна кампанія для пільгових категорій громадян: що відомо?</i>

Наразі офіційної інформації про те, хто з абітурієнтів матиме право на зарахування до університетів за квотами – немає. Що стосується внутрішньо-переміщених осіб, які попередні роки мали квоти, питання залишається відкритим.

<i>Чи буде діяти сільський коефіцієнт?</i>

Зазвичай під час вступної кампанії діють три коригувальні коефіцієнти: сільський, регіональний та галузевий. Сільський і галузевий коефіцієнти цього року будуть діяти так, як передбачають умови прийому на 2022 рік. Регіональний коефіцієнт зазнає певних змін, оскільки зараз суттєво змінюються регіональні пріоритети вступників і закладів освіти. Про нього більш докладно варто говорити тоді, коли буде затверджено порядок прийому

<i>Чи буде враховуватись середній бал атестата?</i>

Цього року середній бал атестата при вступі враховуватися не буде

<i>Чи зміниться вартість навчання в університетах?</i> 

Кабмін тимчасово призупинив дію постанови про індикативну собівартість.

<i>Документи про освіту можуть з’явитися в “Дії”</i>

Ведеться робота над тим, щоб документи, зокрема про повну загальну середню освіту, могли відображатися у додатку “Дія”. Однак питання, де саме абітурієнт зможе використати ці е-документи, наразі залишається відкритим. Перенести відповідні документи в “Дію”, коли така функція буде доступною, можна буде лише після внесення їх у відповідний реєстр. Після цього всі випускники зможуть отримати електронне свідоцтво про повну загальну середню освіту, і звичайне – пластикове.
"""

contacts_have_questions = """
<b>Ви не змогли отримати потрібної інформації з питанням, яке Вас цікавить?</b> 

Задайте своє питання працівнику приймальної комісії прямо в Telegram/Viber або напишіть на пошту:
Пошта: vstup@nupp.edu.ua
Viber: <code>+380990576517</code>
Telegram: @sveta_revenko

Або ж скористайтеся телефоном приймальної комісії:
Тел.: <code>+38(0532)56-16-04</code>
"""

# motivation letter

ml_start_info = ", пропонуємо Вам обрати спеціальність, яка Вас цікавить."

ml_get_school = """
Для генерації мотиваційного листа просимо дати відповіді на кілька запитань.

Повна назва закладу, навчання в якому Ви завершили. Наприклад, Полтавському науковому ліцеї №3.

👇
"""

ml_get_best_lessons = """
З яких предметів Ви маєте високі бали?

Наприклад: англійської мови, хімії, біології.

👇
"""

ml_best_three_motivation = """
Назвіть три основні причини, через які Ви обрали саме наш університет (у такому форматі без лапок):
 
1 - "причина"
2 - "причина" 
3 - "причина"

👇
"""

ml_action_out_lessons = """
Якою діяльністю, пов'язаною з майбутньою професією, Ви займалися у вільний від навчання в школі час?

Відповідь подайте у форматі: займаючись волонтерською діяльністю, працюючи в закладі швидкого харчування.

👇
"""

ml_have_success_in_competition = """
Чи маєте Ви успіхи на предметних олімпіадах? 

Якщо так, то опишіть їх у такому форматі:
"перше місце в міській з "назва предмету" та третє в обласній з "назва предмету".
 
Якщо ні, то введіть 0.
 
👇
"""

ml_get_sex = """
Вкажіть Вашу стать

👇
"""

ml_have_great_attestat = """
Чи отримали Ви атестат із відзнакою?

👇
"""