from models.base import BaseModel


class MotivationLetter(BaseModel):
    def __init__(self,
                 school_name=None,
                 best_lessons=None,
                 three_motivation=None,
                 action_out_lessons=None,
                 have_success_in_competition=None,
                 sex=None,
                 have_great_attestat=None):
        self.school_name = school_name
        self.best_lessons = best_lessons
        self.three_motivation = three_motivation
        self.action_out_lessons = action_out_lessons
        self.have_success_in_competition = have_success_in_competition
        self.sex = sex
        self.have_great_attestat = have_great_attestat

    def make_text(self):
        text = """
Шановний Олексіє Олексійовичу!
Я пишу цей мотиваційний лист, бо прагну навчатися у Полтавському університеті економіки і торгівлі на бакалаврській 
програмі зі спеціальності «Менеджмент», оскільки Ваш університет має низку переваг, серед яких найвагомішими для мене є: 1 - причина.
У цьому році я закінчила ШКОЛА_ТЕСТ. 
Я не лише маю хороші оцінки з профільних предметів, такі як АНГЛІЙСЬКА але й 
також цікавилася навчальними дисциплінами цієї спеціальності, які не входять у шкільну програму.
Зокрема, мене зацікавили такі напрямки як менеджмент, маркетинг, бізнес аналіз.
Я завжди хотіла бути підприємцем і я вважаю, що ваш університет може допомогти мені 
перетворити свою мрію в реальність. На мою думку, успішний підприємець повинен бути 
впевненим, відкритим, креативним, пристрасним та здатним до ризику.
Я розумію, що для того, щоб бути хорошим фахівцем потрібно поєднувати навчання та практичну роботу. Тому у вільний від навчання в школі час, я отримувала практичний досвід, ЗАЙМАЮСЬ ГРАФФИТИ.
Цей практичний досвід лише підвищив мій інтерес продовжувати освіту та вступити на 
бакалаврат за спеціальністю "Менеджмент".
"""